<?php
/**
 * 抓取页面数据
 * User: dingding <352926@qq.com>
 * Date: 2018/8/20
 * Time: 15:21
 */

set_time_limit(0);
ini_set('memory_limit', '128M');
define('FCPATH', dirname(__FILE__) . '/');

require_once FCPATH . 'lib.php';
//此部分为调用自己服务器微信api，以及签名方法、秘钥等，不方便公开
//其它需要使用此签到系统的人可以注释 wx.php 以及lib.php 里的send方法
require_once FCPATH . 'wx.php';
$sign = new Sign();
$sign->fetch_user_info(true);


#4月1号（含）开始
#5月1号 50
#6月1号 100
#7月1号 150 300
#8月1号 200
#9月1号 250
#10月1号 300 3000
#11月1号 350
#12月1号 400
#01月1号 450
#02月1号 500
#03月1号 550
#04月8号 600 10000

#04月8号 dd:5061+2850+900+10000=18811
#05月8号 ll:2513+30*5+3000+2850+900+10000=19413
#04月8号 dm:5739+2850+900+10000=19489
#lingling: 2088+250+15+5*30+3000+350+400+450+500+550+600+300+10000+5*180=19553(预计)
#